Repository: DenisZakharchuk/openprocurement.integrations.edr
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Basic request
uk: Базовий запит

source: In order to get information from EDR by code EDRPOU you need to make a request to `api/1.0/verify` endpoint, passing code as GET parameter:
uk: Для того щоб отримати інформацію з Єдиного Державного реєстру за допомогою ЄДРПОУ Вам необхідно зробити запит до точки входу `api/1.0/verify`, передаючи даний ЄДРПОУ як GET параметр:

source: Response consists of the following fields: `x_edrInternalId`, `registrationStatusDetails`, `registrationStatus`, `identification.schema`, `identification.id`, `identification.legalName`, `identification.url`.
uk: Відповідь складається з наступних полів: `x_edrInternalId`, `registrationStatusDetails`, `registrationStatus`, `identification.schema`, `identification.id`, `identification.legalName`, `identification.url`.

source: `x_edrInternalId` - unique identification of the subject,
uk: `x_edrInternalId` - унікальний ідентифікатор суб'єкта ,

source: `registrationStatusDetails` - text state of the entity (uk),
uk: `registrationStatusDetails` - текстове відображення стану суб'єкта(укр),

source: `registrationStatus` - text state of the entity,
uk: `registrationStatus` - текстове відображення стану суб'єкта,

source: `identification.id` - EDRPOU; if the subject - an individual entrepreneur - instead of IPN system returns ten zeros, because the data is confidential,
uk: `identification.id` - ЄДРПОУ; якщо суб'єкт - фізична особа підприємець - замість ІПНа система поверне десять нулів, бо ці дані є конфіденційною інформацією,

source: `identification.legalName` - name of the entity,
uk: `identification.legalName` - назва,

source: `identification.url` - link to the entity with detailed information.
uk: `identification.url` - посилання на екземпляр з деталізованою інформацію.

source: Also response contains `meta.sourceDate` field - date when information from EDR API was received.
uk: Також відповідь містить поле `meta.sourceDate` - дата отримання інформації від ЄДР API.

source: Request with Individual Tax Number
uk: Запит з індивідуальним податковим номером

source: If you need to obtain information about individual entrepreneurs then send a request with code IPN:
uk: Якщо Вам необхідно отримати інформацію для фізичних осіб-підприємців тоді необхідно відправити запит з ІПН:

source: Errors
uk: Помилки

source: Response to the unsuccessful request contains list of errors with description, code in response body and status.
uk: Відповідь на невдалий запит містить список з текстовим відображенням помилками, коду помилки в тілі відповіді та статусу.

source: API returns the following response when limit of requests to the resource is reached:
uk: API повертає таку відповідь, коли вичерпано обмеження запитів до ресурсу:

source: Response contains message with time when current limitation will expire.
uk: Відповідь матиме відповідний текст та час, через який сплине це обмеження.

source: When given EDRPOU (IPN) were not found in EDR response will contains message `EDRPOU not found`:
uk: Коли даний ЄДРПОУ (ІПН або серія на номер паспорту) не знайдений, відповідь містить повідомлення `EDRPOU not found`.

source: When GET parameter `code` or `passport` is not passed proxy-server will return response with error:
uk: Якщо GET-параметр `code` або `passport` відсутній в запиті, то ЕДР-проксі поверне наступну помилку:

source: Rest of errors appears on the proxy-server side and can contain one of next messages:
uk: Інші помилки виникають на стороні ЕДР-проксі та можуть мати вигляд одної з наступних помилок:

source: or
uk: або

source: These errors are not related to the created request.
uk: Ці помилки не зв'язані з данними із запиту.

source: File-reference
uk: Файл-довідка

source: There are another endpoint `/details/x_edrInternalId` to process request to EDR to get detailed information using parameter `x_edrInternalId`, received in first response. Only user from group `robot` have permissions to process given request. Request looks like:
uk: Існує також інша вхідна точка `/details/x_edrInternalId` для здійснення запитів до ЕДР для отримання деталізованної інформації, використовуючи параметр `x_edrInternalId`, який надходить у відповідь на перший запит. Тільки користувач з группи `robot` має права на здійснення данного запиту. Запит має наступний вигляд:

source: File-reference name is `edr_identification.yaml` and is uploaded to tenders with status ` active.pre-qualification` and `procurementMethodType: aboveThresholdEU, competitiveDialogueUA, competitiveDialogueEU` and tender with status `active.qualification` with `procurementMethodType: aboveThresholdUA, aboveThresholdUA.defense, aboveThresholdEU, competitiveDialogueUA.stage2, competitiveDialogueEU.stage2`. Field `identifier.scheme` should have value `UA-EDR`. File-reference is uploaded to `award/qualification` with `pending` status and contains field `documentType: registerExtract`. If `identifier:id` is not found in EDR, then file will include next error `{error: {code: notFound, errorDetails: Couldn't find this code in EDR.}}`.
uk: Файл-довідка має назву `edr_identification.yaml` та завантажується окремою компонентою при настанні статусу` active.pre-qualification` для тендерів з `procurementMethodType: aboveThresholdEU, competitiveDialogueUA, competitiveDialogueEU` та ` active.qualification` для тендерів з `procurementMethodType: aboveThresholdUA, aboveThresholdUA.defense, aboveThresholdEU, competitiveDialogueUA.stage2, competitiveDialogueEU.stage2` за умови, що identifier.scheme має значення `UA-EDR`. Витяг завантажується в об'єкт `award/qualification` зі статусом `pending` та має тип `documentType: registerExtract`. Якщо `identifier:id` не знайдено в Єдиному Державному реєстрі, то файл містить наступну помилку `{error: {code: notFound, errorDetails: Couldn't find this code in EDR.}}`.

source: File-reference also includes service information in `meta`.
uk: Також файл містить службову інформацію в блоці `meta`.

source: `author` - author of file-reference, have value `IdentificationBot`,
uk: `author` - автор файлу-довідки, має значення `IdentificationBot`,

source: `id` - unique identifier of file-reference,
uk: `id` - унікальний ідентифікатор довідки,

source: `sourceDate` - creation date,
uk: `sourceDate` - дата відповіді від Єдиного Державного реєстру,

source: `sourceRequests` - list of request numbers to `API`, `EDR-proxy`,
uk: `sourceRequests` -список з номерами запитів до `API`, `EDR-proxy`, за допомогою яких було сформовано довідку,

source: `version` - file-reference format version.
uk: `version` - версію формату довідки.

source: Value `meta.version` now have value 1.1.1. First number - major version (delete field, rename, remove), second number - minor version (add field), third number - bugfix version (changes that do not change fields, but fix bugs). For example, changing of file-reference name from `edr_request.yaml` to `edr_identification.yaml` increased first number(major version), adding `meta.author` field increased second number (minor version).
uk: Значення поля `meta.version` зараз дорівнює 1.1.1. Перше число відповідає за major версію (наприклад видалення елемента, перейменування, переміщення), друге число відповідає за minor версію (додавання додаткових атрибутів), третє - bugfix версія (зміни, що не змінюють об'єм чи атрибути інформації, але виправляють помилки). Наприклад зміна назви файлу з `edr_request.yaml` на `edr_identification.yaml` це збільшення major версії, а додавання поля `meta.author` це збільшення minor версії.
